[Killed] BlockStatement
communities/src/community-requests/community-requests.service.ts:21:86
   ) {}
 
   // Crear una nueva solicitud
-  async createRequest(createRequestDto: CreateCommunityRequestsDto): Promise<string> {
-    const existingCommunity = await this.requestModel.findOne({
-      name: createRequestDto.name,
-      status: { $in: [CommunityRequestStatus.Pending, CommunityRequestStatus.Approved] },
-    }).exec();
-    
-    if (existingCommunity) {
-      throw new BadRequestException(
-        `A request with the community name ${createRequestDto.name} already exists`
-      );
-    }
-
-    const createdRequest = await this.requestModel.create(createRequestDto);
-    
-    return String(createdRequest._id);
-  }
+  async createRequest(createRequestDto: CreateCommunityRequestsDto): Promise<string> {}
 
   // Listar todas las solicitudes pendientes
killedBy: CommunityRequestsService createRequest should throw BadRequestException if a pending or approved request with the same name exists
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
communities/src/community-requests/community-requests.service.ts:27:9
       status: { $in: [CommunityRequestStatus.Pending, CommunityRequestStatus.Approved] },
     }).exec();
     
-    if (existingCommunity) {
+    if (false) {
       throw new BadRequestException(
         `A request with the community name ${createRequestDto.name} already exists`
killedBy: CommunityRequestsService createRequest should throw BadRequestException if a pending or approved request with the same name exists
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: "undefined"

[Killed] BlockStatement
communities/src/community-requests/community-requests.service.ts:39:62
   }
 
   // Listar todas las solicitudes pendientes
-  async findAllPending(): Promise<CommunityRequestsEntity[]> {
-    const requests = await this.requestModel.find({ status: CommunityRequestStatus.Pending }).exec();
-    return requests.map(request => this.mapToEntity(request));
-  }
+  async findAllPending(): Promise<CommunityRequestsEntity[]> {}
 
   async findOne(id: string): Promise<CommunityRequestsEntity> {
killedBy: CommunityRequestsService findAllPending should return all pending requests
statusReason: TypeError: Cannot read properties of undefined (reading 'every')

[Survived] ObjectLiteral
communities/src/community-requests/community-requests.service.ts:40:51
 
   // Listar todas las solicitudes pendientes
   async findAllPending(): Promise<CommunityRequestsEntity[]> {
-    const requests = await this.requestModel.find({ status: CommunityRequestStatus.Pending }).exec();
+    const requests = await this.requestModel.find({}).exec();
     return requests.map(request => this.mapToEntity(request));
   }

[Killed] ArrowFunction
communities/src/community-requests/community-requests.service.ts:41:25
   // Listar todas las solicitudes pendientes
   async findAllPending(): Promise<CommunityRequestsEntity[]> {
     const requests = await this.requestModel.find({ status: CommunityRequestStatus.Pending }).exec();
-    return requests.map(request => this.mapToEntity(request));
+    return requests.map(() => undefined);
   }
 
killedBy: CommunityRequestsService findAllPending should return all pending requests
statusReason: TypeError: Cannot read properties of undefined (reading 'status')

[Killed] BlockStatement
communities/src/community-requests/community-requests.service.ts:44:63
     return requests.map(request => this.mapToEntity(request));
   }
 
-  async findOne(id: string): Promise<CommunityRequestsEntity> {
-    const request = await this.requestModel.findById(id).exec();
-    if (!request) {
-      throw new NotFoundException(`Community with ID ${id} not found`);
-    }
-    return this.mapToEntity(request);
-  }
+  async findOne(id: string): Promise<CommunityRequestsEntity> {}
 
   // Aprobar una solicitud y crear la comunidad
killedBy: CommunityRequestsService findOne should throw NotFoundException if request is not found
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BooleanLiteral
communities/src/community-requests/community-requests.service.ts:46:9
 
   async findOne(id: string): Promise<CommunityRequestsEntity> {
     const request = await this.requestModel.findById(id).exec();
-    if (!request) {
+    if (request) {
       throw new NotFoundException(`Community with ID ${id} not found`);
     }
killedBy: CommunityRequestsService findOne should throw NotFoundException if request is not found
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected message: "Community with ID nonexistent-id not found"
Received message: "Cannot read properties of null (reading '_id')"

      210 |       stryCov_9fa48("56");
      211 |       return stryMutAct_9fa48("57") ? {} : (stryCov_9fa48("57"), {
    > 212 |         id: String(document._id),

[Killed] ConditionalExpression
communities/src/community-requests/community-requests.service.ts:46:9
 
   async findOne(id: string): Promise<CommunityRequestsEntity> {
     const request = await this.requestModel.findById(id).exec();
-    if (!request) {
+    if (true) {
       throw new NotFoundException(`Community with ID ${id} not found`);
     }
killedBy: CommunityRequestsService findOne should return the request if found
statusReason: NotFoundException: Community with ID 1 not found

[Killed] ConditionalExpression
communities/src/community-requests/community-requests.service.ts:57:9
     const request1 = await this.requestModel.findById(
       requestId).exec();
 
-    if (!request1) {
+    if (true) {
       throw new NotFoundException('Solicitud no encontrada');
     }
killedBy: CommunityRequestsService approveRequest should call communityService.create and update request status to Approved
statusReason: NotFoundException: Solicitud no encontrada

[Killed] ConditionalExpression
communities/src/community-requests/community-requests.service.ts:57:9
     const request1 = await this.requestModel.findById(
       requestId).exec();
 
-    if (!request1) {
+    if (false) {
       throw new NotFoundException('Solicitud no encontrada');
     }
killedBy: CommunityRequestsService approveRequest should throw NotFoundException if request does not exist
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected message: "Solicitud no encontrada"
Received message: "Cannot read properties of null (reading 'status')"

      132 |         }
      133 |       }
    > 134 |       if (stryMutAct_9fa48("25") ? request1.status !== CommunityRequestStatus.Approved : stryMutAct_9fa48("24") ? false : stryMutAct_9fa48("23") ? true : (stryCov_9fa48("23", "24",

[Killed] EqualityOperator
communities/src/community-requests/community-requests.service.ts:61:9
       throw new NotFoundException('Solicitud no encontrada');
     }
 
-    if (request1.status === CommunityRequestStatus.Approved ) {
+    if (request1.status !== CommunityRequestStatus.Approved ) {
       throw new BadRequestException('La solicitud no ha sido aprobada');
     }
killedBy: CommunityRequestsService approveRequest should call communityService.create and update request status to Approved
statusReason: BadRequestException: La solicitud no ha sido aprobada

[Killed] BlockStatement
communities/src/community-requests/community-requests.service.ts:61:63
       throw new NotFoundException('Solicitud no encontrada');
     }
 
-    if (request1.status === CommunityRequestStatus.Approved ) {
-      throw new BadRequestException('La solicitud no ha sido aprobada');
-    }
+    if (request1.status === CommunityRequestStatus.Approved ) {}
 
     if (request1.status === CommunityRequestStatus.Rejected ) {
killedBy: CommunityRequestsService approveRequest should throw BadRequestException if request is already approved (Approve)
statusReason: Error: expect(received).rejects.toThrowError(expected)

Expected message: "La solicitud no ha sido aprobada"
Received message: "Cannot read properties of undefined (reading 'name')"

      154 |       })).exec();
      155 |       const createCommunity: CreateCommunityDto = stryMutAct_9fa48("36") ? {} : (stryCov_9fa48("36"), {
    > 156 |         name: request.name,

[Killed] BlockStatement
communities/src/community-requests/community-requests.service.ts:65:63
       throw new BadRequestException('La solicitud no ha sido aprobada');
     }
 
-    if (request1.status === CommunityRequestStatus.Rejected ) {
-      throw new BadRequestException('La solicitud no ha sido aprobada');
-    }
+    if (request1.status === CommunityRequestStatus.Rejected ) {}
 
     const request = await this.requestModel.findByIdAndUpdate(
killedBy: CommunityRequestsService approveRequest should throw BadRequestException if request is already reject (Approve)
statusReason: Error: expect(received).rejects.toThrowError(expected)

Expected message: "La solicitud no ha sido aprobada"
Received message: "Cannot read properties of undefined (reading 'name')"

      154 |       })).exec();
      155 |       const createCommunity: CreateCommunityDto = stryMutAct_9fa48("36") ? {} : (stryCov_9fa48("36"), {
    > 156 |         name: request.name,

[Killed] EqualityOperator
communities/src/community-requests/community-requests.service.ts:65:9
       throw new BadRequestException('La solicitud no ha sido aprobada');
     }
 
-    if (request1.status === CommunityRequestStatus.Rejected ) {
+    if (request1.status !== CommunityRequestStatus.Rejected ) {
       throw new BadRequestException('La solicitud no ha sido aprobada');
     }
killedBy: CommunityRequestsService approveRequest should call communityService.create and update request status to Approved
statusReason: BadRequestException: La solicitud no ha sido aprobada

[Survived] ObjectLiteral
communities/src/community-requests/community-requests.service.ts:71:7
 
     const request = await this.requestModel.findByIdAndUpdate(
       requestId,
-      { status: CommunityRequestStatus.Approved },
+      {},
       { new: true },
     ).exec();

[Survived] BooleanLiteral
communities/src/community-requests/community-requests.service.ts:72:14
     const request = await this.requestModel.findByIdAndUpdate(
       requestId,
       { status: CommunityRequestStatus.Approved },
-      { new: true },
+      { new: false },
     ).exec();
 

[Killed] ObjectLiteral
communities/src/community-requests/community-requests.service.ts:75:49
       { new: true },
     ).exec();
 
-    const createCommunity: CreateCommunityDto = {
-      name: request.name,
-      description: request.description,
-      admin: request.creator,
-      causes: request.causes,
-    };
+    const createCommunity: CreateCommunityDto = {};
 
     const id = await this.communityService.create(createCommunity);
killedBy: CommunityRequestsService approveRequest should call communityService.create and update request status to Approved
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "admin": 1,
-   "causes": Array [

[Killed] BlockStatement
communities/src/community-requests/community-requests.service.ts:88:57
   }
   
   // Rechazar una solicitud
-  async rejectRequest(requestId: string): Promise<void> {
-    const request1 = await this.requestModel.findById(
-      requestId,
-    ).exec();
-
-    if (!request1) {
-      throw new NotFoundException('Solicitud no encontrada');
-    }
-
-    if (request1.status === CommunityRequestStatus.Approved ) {
-      throw new BadRequestException('La solicitud no ha sido rechazada');
-    }
-
-    if (request1.status === CommunityRequestStatus.Rejected ) {
-      throw new BadRequestException('La solicitud no ha sido rechazada');
-    }
-
-    await this.requestModel.findByIdAndUpdate(
-      requestId,
-      { status: CommunityRequestStatus.Rejected },
-      { new: true },
-    ).exec();
-  }
+  async rejectRequest(requestId: string): Promise<void> {}
 
 
killedBy: CommunityRequestsService rejectRequest should throw NotFoundException if request does not exist
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
communities/src/community-requests/community-requests.service.ts:93:20
       requestId,
     ).exec();
 
-    if (!request1) {
-      throw new NotFoundException('Solicitud no encontrada');
-    }
+    if (!request1) {}
 
     if (request1.status === CommunityRequestStatus.Approved ) {
killedBy: CommunityRequestsService rejectRequest should throw NotFoundException if request does not exist
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected message: "Solicitud no encontrada"
Received message: "Cannot read properties of null (reading 'status')"

      179 |         }
      180 |       }
    > 181 |       if (stryMutAct_9fa48("45") ? request1.status !== CommunityRequestStatus.Approved : stryMutAct_9fa48("44") ? false : stryMutAct_9fa48("43") ? true : (stryCov_9fa48("43", "44",

[Killed] ConditionalExpression
communities/src/community-requests/community-requests.service.ts:97:9
       throw new NotFoundException('Solicitud no encontrada');
     }
 
-    if (request1.status === CommunityRequestStatus.Approved ) {
+    if (true ) {
       throw new BadRequestException('La solicitud no ha sido rechazada');
     }
killedBy: CommunityRequestsService rejectRequest should update request status to Rejected
statusReason: BadRequestException: La solicitud no ha sido rechazada

[Killed] BlockStatement
communities/src/community-requests/community-requests.service.ts:97:63
       throw new NotFoundException('Solicitud no encontrada');
     }
 
-    if (request1.status === CommunityRequestStatus.Approved ) {
-      throw new BadRequestException('La solicitud no ha sido rechazada');
-    }
+    if (request1.status === CommunityRequestStatus.Approved ) {}
 
     if (request1.status === CommunityRequestStatus.Rejected ) {
killedBy: CommunityRequestsService rejectRequest should throw BadRequestException if request is already approved (Reject)
statusReason: Error: expect(received).rejects.toThrowError()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] StringLiteral
communities/src/community-requests/community-requests.service.ts:98:37
     }
 
     if (request1.status === CommunityRequestStatus.Approved ) {
-      throw new BadRequestException('La solicitud no ha sido rechazada');
+      throw new BadRequestException("");
     }
 
killedBy: CommunityRequestsService rejectRequest should throw BadRequestException if request is already approved (Reject)
statusReason: Error: expect(received).rejects.toThrowError(expected)

Expected message: "La solicitud no ha sido rechazada"
Received message: "Bad Request"

      184 |         } else {
      185 |           stryCov_9fa48("46");
    > 186 |           throw new BadRequestException(stryMutAct_9fa48("47") ? "" : (stryCov_9fa48("47"), 'La solicitud no ha sido rechazada'));

[Killed] BlockStatement
communities/src/community-requests/community-requests.service.ts:101:63
       throw new BadRequestException('La solicitud no ha sido rechazada');
     }
 
-    if (request1.status === CommunityRequestStatus.Rejected ) {
-      throw new BadRequestException('La solicitud no ha sido rechazada');
-    }
+    if (request1.status === CommunityRequestStatus.Rejected ) {}
 
     await this.requestModel.findByIdAndUpdate(
killedBy: CommunityRequestsService rejectRequest should throw BadRequestException if request is already reject (Reject)
statusReason: Error: expect(received).rejects.toThrowError()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BooleanLiteral
communities/src/community-requests/community-requests.service.ts:108:14
     await this.requestModel.findByIdAndUpdate(
       requestId,
       { status: CommunityRequestStatus.Rejected },
-      { new: true },
+      { new: false },
     ).exec();
   }
killedBy: CommunityRequestsService rejectRequest should update request status to Rejected
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "1",
  {"status": "Rejected"},
  Object {

[Killed] BlockStatement
communities/src/community-requests/community-requests.service.ts:114:85
 
 
   // Método helper para mapear de Document a Entity
-  private mapToEntity(document: CommunityRequestsDocument): CommunityRequestsEntity {
-    return {
-      id: String(document._id),
-      name: document.name,
-      description: document.description,
-      creator: document.creator,
-      status: document.status,
-      requestDate: document.requestDate,
-      causes: document.causes
-    };
-  }
+  private mapToEntity(document: CommunityRequestsDocument): CommunityRequestsEntity {}
 }
 
killedBy: CommunityRequestsService findAllPending should return all pending requests
statusReason: TypeError: Cannot read properties of undefined (reading 'status')

[Killed] ObjectLiteral
communities/src/community-requests/community-requests.service.ts:115:12
 
   // Método helper para mapear de Document a Entity
   private mapToEntity(document: CommunityRequestsDocument): CommunityRequestsEntity {
-    return {
-      id: String(document._id),
-      name: document.name,
-      description: document.description,
-      creator: document.creator,
-      status: document.status,
-      requestDate: document.requestDate,
-      causes: document.causes
-    };
+    return {};
   }
 }
killedBy: CommunityRequestsService findAllPending should return all pending requests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
